semestr1/logika/16.11.20-w.md

# Table of Contents

1.  [Logika](#org156c905)
    1.  [logika scholastyczna](#orgb55477f)
        1.  [starożytność](#orgafd3ac1)
        2.  [średniowiecze](#orge618afc)
        3.  [nowożytność](#orgc096a8d)
    2.  [symbole logiczne](#orgc1310a9)
    3.  [logika jako rachunek](#orgeb0fc4e)
2.  [Metoda założeniowa](#org881ecb1)
3.  [Metoda aksjomatyczna](#org9b3add6)
4.  [Desygnat](#org8ec96b0)
5.  [Nazwy](#org11ee492)
    1.  [Ze względu na złożoność](#orgc1377ae)
        1.  [Nazwa prosta](#orgc8a8822)
        2.  [Nazwa złożona](#orgdf589e6)
    2.  [Ze wzdględu na liczbę desygnatów](#org194fdd9)
        1.  [Nazwy puste](#org94fa91e)
        2.  [Nazwy jednostkowe](#orge3bef6f)
        3.  [Nazwa ogólna](#org63cfdd0)
    3.  [Ze względu na sposób odniesienia do desygnatu](#orgb0cc312)
        1.  [Nazwy generalne](#org0dd67b4)
        2.  [Nazwy indywidualne](#org72773ce)
    4.  [Ze wględu na rodzaj desygnatu](#org3ccd574)
        1.  [Nazwy konkretne](#org383ae93)
        2.  [Nazwa abstrakcyjne](#orgce3077c)
    5.  [Ze wględu na strukturę](#org53f9f32)
        1.  [Nazwy zbiorowe](#org820012f)
        2.  [Nazwy niezbiorowe](#orgd6f07b4)
    6.  [s](#org880d140)
        1.  [Nazwy relatywne](#org19d2cee)
        2.  [Nazwy niereltywne](#org9266f56)
    7.  [Brak](#org5f961c6)
        1.  [Nazwy prywarywne](#org6ba8c56)
        2.  [Nazwy nieprywatywne](#orgcdcba1a)



<a id="org156c905"></a>

# Logika


<a id="orgb55477f"></a>

## logika scholastyczna


<a id="orgafd3ac1"></a>

### starożytność

-   bóg
-   kwestia odnesienia - czy logika odnosi się do jakiejś rzeczywistości czy nie
-   platon
    -   świat idealny istnieje ****naprawdę****
-   arystoteles
    -   wiedza ogólna nie ma ****idealnych**** odpowiedników


<a id="orge618afc"></a>

### średniowiecze

-   nominalizm i realizm
-   sermonizm - nasze odpowiedzi mają charakter ogólny, a myślenie szczególny

1.  devotio moderna

    -   chłodne podejście do rzeczywistości religijnej


<a id="orgc096a8d"></a>

### nowożytność

-   nacisk na odkrycie, a nie uzasadnienie
-   psychologizm - locke, hume


<a id="orgc1310a9"></a>

## symbole logiczne

-   leibnitz
-   universalis, calculus raciotinator


<a id="orgeb0fc4e"></a>

## logika jako rachunek

-   bool


<a id="org881ecb1"></a>

# Metoda założeniowa


<a id="org9b3add6"></a>

# Metoda aksjomatyczna


<a id="org8ec96b0"></a>

# Desygnat

-   rzecz, do której odnosi się nazwa


<a id="org11ee492"></a>

# Nazwy


<a id="orgc1377ae"></a>

## Ze względu na złożoność


<a id="orgc8a8822"></a>

### Nazwa prosta

-   jeden wyraz


<a id="orgdf589e6"></a>

### Nazwa złożona

-   wiele wyrazów


<a id="org194fdd9"></a>

## Ze wzdględu na liczbę desygnatów


<a id="org94fa91e"></a>

### Nazwy puste

-   w ich zakresie nie ma żadnych desygnatów (np )


<a id="orge3bef6f"></a>

### Nazwy jednostkowe

-   w ich zakresie jest jeden desygnat (np naturalny satelita ziemi)


<a id="org63cfdd0"></a>

### Nazwa ogólna

-   w ich zakresie jest wiele desygnatów (np stól, mieszkaniec olsztyna)


<a id="orgb0cc312"></a>

## Ze względu na sposób odniesienia do desygnatu


<a id="org0dd67b4"></a>

### Nazwy generalne

-   ze względu na cechy, jakie przysługują rodzajowi desygnatom (np poeta)


<a id="org72773ce"></a>

### Nazwy indywidualne

-   arbitralnie odnosząca sie do danego desygnatu


<a id="org3ccd574"></a>

## Ze wględu na rodzaj desygnatu


<a id="org383ae93"></a>

### Nazwy konkretne

-   konkretne, instniejące rzeczy


<a id="orgce3077c"></a>

### Nazwa abstrakcyjne

-   nazwy, których desygnatami są byty abstrakcyjne


<a id="org53f9f32"></a>

## Ze wględu na strukturę


<a id="org820012f"></a>

### Nazwy zbiorowe


<a id="orgd6f07b4"></a>

### Nazwy niezbiorowe

-   struktura obiektu nie jest łatwa do rozdzielenia


<a id="org880d140"></a>

## s


<a id="org19d2cee"></a>

### Nazwy relatywne

-   wskazuje na relacje desygnatu z innym obiektem


<a id="org9266f56"></a>

### Nazwy niereltywne

-   nie wskazuje na relacje desygnatu


<a id="org5f961c6"></a>

## Brak


<a id="org6ba8c56"></a>

### Nazwy prywarywne


<a id="orgcdcba1a"></a>

### Nazwy nieprywatywne

